const sum = require('./sum');
// 1 + 2 เท่ากับ 3

test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21

test('20 + 1 เท่ากับ 21' , () => {
  expect(sum(20,1)).toBe(21)
} )


// 2 + 5 เท่ากับ 7

test('2 + 5 เท่ากับ 7' , () => {
  expect(sum(2,5)).toBe(7)
})

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// 59 + 160 เท่ากับ 219
test('59 + 160 เท่ากับ 219' , () => {
  expect(sum(59 , 160)).toBe(219)
})

// 160 + 59 เท่ากับ 219
test('160 + 59 เท่ากับ 219' , () => {
  expect(sum(160 , 59)).toBe(219)
})

  // 5 + 0 เท่ากับ 5 
  test('5 + 0 เท่ากับ 5' , () =>{
    expect(sum(5,0)).toBe(5)
  })